modules_cxf_src_test_java_org_mule_runtime_module_cxf_ProxyTestCase.java/[CN]/ProxyTestCase/[MT]/testProxyJms()/body

{
  String payload="<soap:Envelope xmlns:soap=\"http://www.w3.org/2003/05/soap-envelope\">" + "<soap:Body>" + "<emp:addEmployee xmlns:emp=\"http://employee.example.mule.org/\">"+ "<emp:employee>"+ "<emp:division>Runtime</emp:division>"+ "<emp:name>Pepe</emp:name>"+ "</emp:employee>"+ "</emp:addEmployee>"+ "</soap:Body>"+ "</soap:Envelope>";
  MuleClient client=muleContext.getClient();
  MuleMessage result=client.send("http://localhost:" + dynamicPort.getNumber() + "/proxyJms",getTestMuleMessage(payload),HTTP_REQUEST_OPTIONS);
  assertThat(result,is(notNullValue()));
  assertThat(getPayloadAsString(result),is(payload));
}
